#include "menu.h"
#include <stdio.h>
/******************************************
 *函数名:menu			          		  *	
 *功能: 主菜单						      *	
 *参数:无			         			  *	
 *返回值:void		         			  *	
 ******************************************/
void menu()
{
	puts("\t*******************************\t");
	puts("\t*       1、顾客购物           *\t");
	puts("\t*       2、后台登录           *\t");
	puts("\t*       3、管理员登录         *\t");
	puts("\t*       0、退出系统           *\t");
	puts("\t*******************************\t");
}
/******************************************
 *函数名:enroll_menu			          *	
 *功能: 进入后台管理系统之后的菜单选项    *	
 *参数:无			         			  *	
 *返回值:void		         			  *	
 ******************************************/

void enroll_menu()//进入后台管理系统之后的菜单选项
{
	puts("\t*****************************\t");
	puts("\t*     欢迎进入超市管理系统  *\t");
	puts("\t*        1、添加商品        *\t");
	puts("\t*        2、账目清算        *\t");
	puts("\t*        3、售卖商品情况    *\t");
	puts("\t*        4、账户充值	    *\t");
	puts("\t*        5、显示账户信息    *\t");
	puts("\t*        0、退出系统        *\t");
	puts("\t*****************************\t");
}
/******************************************
 *函数名:msg_menu			          	  *	
 *功能:进入管理员系统之后的菜单选项		  *	
 *参数:无			         			  *	
 *返回值:void		         			  *	
 ******************************************/
void msg_menu()//进入后台管理系统之后的菜单选项
{
	puts("\t*****************************\t");
	puts("\t*     欢迎进入管理员系统    *\t");
	puts("\t*        1、添加账户        *\t");
	puts("\t*        2、修改账户        *\t");
	puts("\t*        3、查询账户        *\t");
	puts("\t*        4、删除账户        *\t");
	puts("\t*        0、退出系统        *\t");
	puts("\t*****************************\t");
}